{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "Hardware",
    "1": "Access",
    "2": "Miscellaneous",
    "3": "HR Support",
    "4": "Purchase",
    "5": "Administrative rights",
    "6": "Storage",
    "7": "Internal Project"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Access": 1,
    "Administrative rights": 5,
    "HR Support": 3,
    "Hardware": 0,
    "Internal Project": 7,
    "Miscellaneous": 2,
    "Purchase": 4,
    "Storage": 6
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.1",
  "vocab_size": 119547
}
